---
kind: type
id: T:Autodesk.Revit.DB.Electrical.CircuitSequence
source: html/6875e36f-34fd-160c-1c64-69e75d0cd30f.htm
---
# Autodesk.Revit.DB.Electrical.CircuitSequence

Options of circuit sequence for assigning circuit to circuits across panel.

## Syntax (C#)
```csharp
public enum CircuitSequence
```